; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-13)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 )
(:init
(arm-empty)
(on b1 b4)
(on b2 b13)
(on b3 b7)
(on-table b4)
(on b5 b2)
(on-table b6)
(on b7 b5)
(on b8 b11)
(on b9 b6)
(on b10 b12)
(on b11 b3)
(on-table b12)
(on-table b13)
(clear b1)
(clear b8)
(clear b9)
(clear b10)
)
(:goal
(and
(on b1 b3)
(on b3 b4)
(on b4 b8)
(on b5 b1)
(on b7 b2)
(on b11 b7)
(on b13 b11))
)
)

; plan
1. (unstack b8 b11)
   deleted: (on b8 b11) (clear b8) (arm-empty)
   added: (holding b8) (clear b11)
   goals met: 0 of 7
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 7
3. (unstack b1 b4)
   deleted: (on b1 b4) (clear b1) (arm-empty)
   added: (holding b1) (clear b4)
   goals met: 0 of 7
4. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 7
5. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 0 of 7
6. (stack b4 b8)
   deleted: (clear b8) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b8)
   goals met: 1 of 7
7. (unstack b11 b3)
   deleted: (on b11 b3) (clear b11) (arm-empty)
   added: (holding b11) (clear b3)
   goals met: 1 of 7
8. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 7
9. (unstack b3 b7)
   deleted: (on b3 b7) (clear b3) (arm-empty)
   added: (holding b3) (clear b7)
   goals met: 1 of 7
10. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 2 of 7
11. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 2 of 7
12. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 3 of 7
13. (unstack b7 b5)
   deleted: (on b7 b5) (clear b7) (arm-empty)
   added: (holding b7) (clear b5)
   goals met: 3 of 7
14. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 3 of 7
15. (unstack b5 b2)
   deleted: (on b5 b2) (clear b5) (arm-empty)
   added: (holding b5) (clear b2)
   goals met: 3 of 7
16. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 4 of 7
17. (unstack b2 b13)
   deleted: (on b2 b13) (clear b2) (arm-empty)
   added: (holding b2) (clear b13)
   goals met: 4 of 7
18. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 4 of 7
19. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 4 of 7
20. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 5 of 7
21. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 5 of 7
22. (stack b11 b7)
   deleted: (clear b7) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b7)
   goals met: 6 of 7
23. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 6 of 7
24. (stack b13 b11)
   deleted: (clear b11) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b11)
   goals met: 7 of 7
